{"data":{"site":{"siteMetadata":{"title":"Lucas Barros","subtitle":"Blog criado com intuito de divulgar o que estudei com dicas e tutorias para ajudar outras pessoas.","copyright":"© Todos direitos públicos","menu":[{"label":"Artigos","path":"/"},{"label":"Sobre mim","path":"/sobre/"}],"author":{"name":"Lucas Barros","email":"devbarros8@gmail.com","telegram":"@devbarros","twitter":"@devbarros","github":"@devbarros8","rss":"#","vk":"#"}}},"markdownRemark":{"id":"5c92b5a1-ac70-5637-bff1-554a1616e564","html":"<p>Olá, meu nome é Lucas Barros, sou um apaixonado por tecnologia e graduado em Gestão de Tecnologia da Informação pela FATEC Guaratinguetá.</p>\n<p>Durante a faculdade tive meu primeiro contato com programação para desenvolver projetos, utilizava Java, C#, MySQL e ASP.NET.\nSendo 4 projetos desenvolvidos durante o curso, 1 com Java e 3 com C#, MySQL e ASP.NET(2 destes com uso de Bootstrap).Projetos estes chamados de PI(projeto interdisciplinar) necessários para conclusão do semestre, são desenvolvidos durante o semestre com base naquilo que já foi aprendido e o que está sendo ensinado no semestre, unindo todas as matérias do curso a fim de criar um sistema usável para empresas, era necessário encontrar uma empresa e questionar o dono a respeito de algum problema que pudesse ser resolvido com um sistema, após levantado o problema era necessário criar a Product Backlog e seguir toda a metodologia Scrum a fim de entregar o projeto que pudesse ser utilizado pela empresa e ajuda-se com o problema.</p>\n<p>Atualmente estou focando meu estudo em React, JavaScript e Node.js, me identifiquei muito com esta stack.\nTambém não posso esquecer do inglês, esta linguagem global essencial nos dias atuais, meu inglês é técnico, não tenho grandes dificuldades em ler artigos, documentação ou livros em inglês, porém às vezes sendo necessário consultar um dicionário para determinadas palavras.</p>\n<p>Estarei postando artigos neste blog conforme meus estudos forem avançando, quando eu tinha dúvidas na maioria das vezes estas foram respondidas através de blogs de maneira direita e sucinta, acredito que desta forma podemos tornar mais acessível a informação para qualquer pessoa.</p>\n<p>Pratico musculação de seg. a sex. 1 hora por dia para manter minha saúde e principalmente meu foco, corrida somente uma vez aos finais de semana.</p>","frontmatter":{"title":"Sobre mim","date":null,"description":null}}},"pageContext":{"slug":"/sobre"}}